{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "batch_input_shape": [null, 1, 28, 28], "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 32, "data_format": "channels_first", "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 32, "data_format": "channels_first"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "rate": 0.5, "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 64, "data_format": "channels_first"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "rate": 0.5, "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 64}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "rate": 0.5, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 10}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_5"}}], "keras_version": "2.1.6"}